Repository: FarhamAghdasi/python-send-ai
Catalog: locale/*/LC_MESSAGES/messages.po
Languages: fa

source: Available project types: python, nodejs, java, go, laravel, nextjs, reactjs, generic
fa: انواع پروژه‌های موجود: پایتون، نودجی‌اس، جاوا، گو، لاراول، نکست‌جی‌اس، ری‌اکت‌جی‌اس، ژنریک

source: Enter project type (default: %s):
fa: نوع پروژه را وارد کنید (پیش‌فرض: %s):

source: Enter the folder path or GitHub URL (default: %s):
fa: مسیر پوشه یا URL گیتهاب را وارد کنید (پیش‌فرض: %s):

source: Enter folder name to filter (default: %s):
fa: نام پوشه برای فیلتر را وارد کنید (پیش‌فرض: %s):

source: Enter folders to exclude (comma-separated, default: %s):
fa: پوشه‌های مستثنی (با کاما جدا شده، پیش‌فرض: %s):

source: Enter file extensions to exclude (comma-separated, default: %s):
fa: پسوندهای فایل مستثنی (با کاما جدا شده، پیش‌فرض: %s):

source: Enter keyword to filter file contents (default: %s):
fa: کلمه کلیدی برای فیلتر محتوای فایل‌ها (پیش‌فرض: %s):

source: Enter regex pattern to filter file contents (default: %s):
fa: الگوی رجکس برای فیلتر محتوای فایل‌ها (پیش‌فرض: %s):

source: Enter output format (txt, json, md, html, default: %s):
fa: فرمت خروجی را وارد کنید (txt, json, md, html، پیش‌فرض: %s):

source: Enter minimum file size in bytes (default: %s):
fa: حداقل اندازه فایل به بایت (پیش‌فرض: %s):

source: Enter modified after date (YYYY-MM-DD, default: %s):
fa: تاریخ تغییر پس از (YYYY-MM-DD، پیش‌فرض: %s):

source: Output exceeds %s characters. Split into multiple files? (y/n):
fa: خروجی بیش از %s کاراکتر است. به چند فایل تقسیم شود؟ (بله/خیر):

source: Usage: 'back' or 'back <step_number>' to return to a specific step.
fa: استفاده: 'back' یا 'back <step_number>' برای بازگشت به مرحله خاص.

source: Error
fa: خطا

source: Warning: Unknown project type '%s', using '%s'
fa: هشدار: نوع پروژه ناشناخته '%s'، استفاده از '%s'

source: Warning: Unknown output format '%s', using '%s'
fa: هشدار: فرمت خروجی ناشناخته '%s'، استفاده از '%s'

source: Project Structure
fa: ساختار پروژه

source: File Contents
fa: محتوای فایل‌ها

source: Path does not exist: %s
fa: مسیر وجود ندارد: %s

source: Path is not a directory: %s
fa: مسیر یک پوشه نیست: %s

source: Could not list directory %s: %s
fa: نمی‌توان پوشه %s را لیست کرد: %s

source: Could not read %s: %s
fa: نمی‌توان %s را خواند: %s

source: Could not process directory %s: %s
fa: نمی‌توان پوشه %s را پردازش کرد: %s

source: Error saving output: %s
fa: خطا در ذخیره خروجی: %s

source: Could not load config.json: %s
fa: نمی‌توان config.json را بارگذاری کرد: %s

source: Output saved to
fa: خروجی ذخیره شد در

source: Unexpected error
fa: خطای غیرمنتظره

source: No output generated.
fa: هیچ خروجی تولید نشد.

source: Processing files
fa: پردازش فایل‌ها

source: Cloning repository: %s
fa: کلون کردن مخزن: %s

source: Failed to clone repository: %s
fa: کلون کردن مخزن ناموفق بود: %s

source: Skipping binary file: %s
fa: رد کردن فایل باینری: %s

source: Potential sensitive content detected in file
fa: محتوای حساس احتمالی در فایل تشخیص داده شد

source: Output copied to clipboard
fa: خروجی در کلیپ‌بورد کپی شد

source: Could not open file %s: %s
fa: نمی‌توان فایل %s را باز کرد: %s

source: Output saved in %s files
fa: خروجی در %s فایل ذخیره شد

source: Project structure and file reader
fa: خواننده ساختار پروژه و فایل

source: Custom mode. Format: folder_path 'folder1,folder2' '.log,.md' Example: -C /path/to/project '.git,.venv' '.svg,.png'
fa: حالت سفارشی. فرمت: مسیر_پوشه 'پوشه1،پوشه2' '.log,.md' مثال: -C /path/to/project '.git,.venv' '.svg,.png'

source: Only include folders containing this name Example: --filter src
fa: فقط پوشه‌های حاوی این نام را شامل کن مثال: --filter src

source: Filter files containing this keyword Example: --keyword import
fa: فیلتر فایل‌های حاوی این کلمه کلیدی مثال: --keyword import

source: Filter files matching this regex pattern Example: --regex '^def\s+\w+'
fa: فیلتر فایل‌های مطابق با این الگوی رجکس مثال: --regex '^def\s+\w+'

source: Output format: txt (plain text), json (JSON), md (Markdown), html (HTML) Example: --format md
fa: فرمت خروجی: txt (متن ساده)، json (JSON)، md (مارک‌داون)، html (HTML) مثال: --format md

source: Project type: %s Example: --project-type nodejs If not provided, auto-detected based on folder contents.
fa: نوع پروژه: %s مثال: --project-type nodejs اگر مشخص نشود، بر اساس محتوای پوشه تشخیص داده می‌شود.

source: GitHub repository URL to clone Example: --remote https://github.com/user/repo
fa: URL مخزن گیتهاب برای کلون مثال: --remote https://github.com/user/repo

source: Run in GUI mode
fa: اجرا در حالت GUI

source: Run in semi-interactive CLI mode with folder/file selection
fa: اجرا در حالت CLI نیمه‌تعاملی با انتخاب پوشه/فایل

source: Copy to clipboard
fa: کپی به کلیپ‌بورد

source: Path to log file
fa: مسیر فایل لاگ

source: Minimum file size in bytes Example: --min-size 1000
fa: حداقل اندازه فایل به بایت مثال: --min-size 1000

source: Only include files modified after this date (YYYY-MM-DD) Example: --modified-after 2023-01-01
fa: فقط فایل‌های تغییر یافته پس از این تاریخ (YYYY-MM-DD) مثال: --modified-after 2023-01-01

source: Language for interface (en, fa) Example: --lang fa
fa: زبان رابط کاربری (en, fa) مثال: --lang fa

source: Project Structure Reader
fa: خواننده ساختار پروژه

source: Success
fa: موفقیت

source: Suggested project type
fa: نوع پروژه پیشنهادی

source: Would you like to add a prompt? (y/n):
fa: آیا می‌خواهید یک پرامپت اضافه کنید؟ (بله/خیر):

source: Select a prompt type (use arrow keys, Enter to select, 'q' to skip):
fa: نوع پرامپت را انتخاب کنید (از کلیدهای جهت‌دار استفاده کنید، Enter برای انتخاب، 'q' برای رد شدن):

source: Would you like to save these settings as a profile? (y/n):
fa: آیا می‌خواهید این تنظیمات را به‌عنوان یک پروفایل ذخیره کنید؟ (بله/خیر):

source: Enter profile name:
fa: نام پروفایل را وارد کنید:

source: Profile '%s' saved successfully
fa: پروفایل '%s' با موفقیت ذخیره شد

source: Could not save profile: %s
fa: نمی‌توان پروفایل را ذخیره کرد: %s

source: Could not save prompt: %s
fa: نمی‌توان پرامپت را ذخیره کرد: %s

source: Select files/folders (use arrow keys, Enter to toggle, 'q' to finish):
fa: انتخاب فایل‌ها/پوشه‌ها (از کلیدهای جهت‌دار استفاده کنید، Enter برای تغییر وضعیت، 'q' برای اتمام):

source: Available prompts:
fa: پرامپت‌های موجود:

source: Starting interactive mode
fa: شروع حالت تعاملی
